Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: The following example shows the inclusion of a custom MyRepresentedCustomView structure in the view hierarchy.
ja: 以下の例は、あつらえのMyRepresentedCustomView 構造体の包含物をビュー階層において示します。

source: The following example shows two circles: One circle at its default position and another outlined with a stroke is overlaid on top and offset by 100 points to the left and 50 points below.
ja: 以下の例は２つの円を示します：それの初期状態の位置での１つの円と、上部で重ねられてそして100ポイント左に50ポイント下に位置埋め合わせされて輪郭を描かれる別のもの。

source: The following example styles the text as 17 point regular, and uses a Font.Design.rounded system font:
ja: 以下の例は、テキストを17ポイントregularとしてスタイル指定します、そしてFont.Design.roundedシステムフォントを使います：

source: The following example uses the first(where:) method to find the first negative number in an array of integers:
ja: 以下の例は、first(where:)メソッドを使って、整数の配列において最初の負数を見つけます：

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string at each space character (” “). The first use of split returns each word that was originally separated by one or more spaces.
ja: 以下の例は、ある文字列を各空白文字（” “）で分割する場合のmaxSplitsとomittingEmptySubsequencesパラメータの効果を示します。splitの最初の利用は、各単語を返します、それはもともと１つ以上の空白で隔てられています。

source: The following examples show the effects of the maxSplits and omittingEmptySubsequences parameters when splitting a string using a closure that matches spaces.
ja: 以下の例は、maxSplitsとomittingEmptySubsequencesパラメータの効果を、空白にマッチするクロージャを使って文字列を分割する場合で示します。

source: The following image shows a photo next to that same photo with the contrast set to 3:
ja: 以下の画像は、ある写真を、そのコントラストを３に設定した同じ写真の隣に示します。

source: The following shows two version of the same image side by side; at left is the original, and at right is a duplicate with its colors inverted:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれの色を反転した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with its blur radius set to 10:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれのぼかし半径を10に設定した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with its brightness set to 0.6:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれの明るさを0.6に設定した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with its hues rotated by 45 degrees:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれの色相を45度だけ回転した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with its opacity set to 0.5:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれの不透明性を0.5に設定した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with its saturation set to 3.5:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はそれの彩度を3.5に設定した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with the colorMultiply(_:) modifier applied with Color.purple.
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はColor.purpleで適用されたcolorMultiply(_:)修飾子をもつ複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with the grayscale(_:) modifier’s amount parameter set to 0.75:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はgrayscale(_:)修飾子のもつamountパラメータを0.75に設定した複製です：

source: The following shows two versions of the same image side by side; at left is the original, and at right is a duplicate with the luminanceToAlpha() modifier applied:
ja: 以下は２つの版の同じ画像を並べて示します；左は元のものです、そして右はluminanceToAlpha()修飾子を適用された複製です：

source: The following styles the system font as 17 point, semibold text:
ja: 以下は、システムフォントを17ポイント、semiboldテキストとしてスタイル指定します：

source: The following table show the various alignment guides next to each other.
ja: 以下の表は、互いに接するさまざまな整列ガイドを示します。

source: The following values are supported:
ja: 以下の値がサポートされます：

source: The font to use when displaying this text.
ja: このテキストを表示する時に使うフォント。

source: The font weight to apply to text.
ja: テキストに適用するフォントウェイト。

source: The fraction of the way through drawing this shape where drawing ends.
ja: この形状を端から端まで描画する道程の割合、そこにおいて描画を終了します。

source: The fraction of the way through drawing this shape where drawing starts.
ja: この形状を端から端まで描画する道程の割合、そこにおいて描画を開始します。

source: The frame of reference for describing this shape.
ja: この形状を記述するための基準系。

source: The frame rectangle for the new view object.
ja: 新しいビューオブジェクトに対するフレーム矩形。

source: The framework provides event handlers for delivering taps, gestures, and other types of input to your app, and tools to manage the flow of data from your app's models down to the views and controls that users will see and interact with.
ja: このフレームワークは、タップ、ジェスチャ、および他の種類の入力をあなたのアプリに届けるイベントハンドラ、そしてあなたのアプリのもつモデルからビューとコントロールへ至るデータの流れを管理するツールを提供します。

source: The framework provides event handlers for delivering taps, gestures, and other types of input to your app, and tools to manage the flow of data from your app’s models down to the views and controls that users will see and interact with.
ja: このフレームワークは、タップ、ジェスチャ、および他の種類の入力をあなたのアプリに届けるイベントハンドラ、そしてあなたのアプリのもつモデルからビューとコントロールへ至るデータの流れを管理するツールを提供します。

source: The gesture receives updates while the user presses the modifier keys that correspond to the given modifiers option set.
ja: ジェスチャは、ユーザがその与えられた修飾子オプションセットに対応する修飾キーを押す間に更新を受け取ります。

source: The given argument without any changes.
ja: 与えられた引数、全く変更なしに。

source: The gradient applies the color function along an axis, as defined by its start and end points.
ja: 勾配（グラデーション）は、カラー関数をある軸に沿って適用します、それの開始および終了点によって定義されるように。

source: The gradient applies the color function as the distance from a center point, scaled to fit within the defined start and end radii.
ja: 勾配（グラデーション）は、色関数を中心点からの隔たりとして適用します、開始そして終了半径内に収まるように縮尺されます。

source: The gradient maps the unit-space center point into the bounding rectangle of each shape filled with the gradient.
ja: 勾配は、単位空間の中心点を、勾配で満たされる（グラデーションで塗りつぶされる）各形状の境界矩形へとマップします。

source: The gradient maps the unit-space points into the bounding rectangle of each shape filled with the gradient.
ja: 勾配は、単位空間点それらを、勾配で満たされる（グラデーションで塗りつぶされる）各形状の境界矩形へとマップします。

source: The gradient synthesizes its location values to evenly space the colors along the gradient.
ja: 勾配はそれの位置値を、勾配に沿って等間隔に置かれた色へと合成します、

source: The guide for aligning the subviews in this stack on both axis.
ja: このスタックの中のサブビューそれらを両方の軸に関して整列するためのガイド。

source: The guide for aligning the subviews in this stack.
ja: このスタックの中のサブビューを整列するためのガイド。

source: The hash function to use when combining the components of the truncation mode.
ja: 切り詰めモードの構成要素それらを結合する時に使うハッシュ関数。

source: The hash value for the value of a simultaneous gesture.
ja: ある同時ジェスチャの値に対するハッシュ値。

source: The hash value is not guaranteed to be stable across different invocations of the same program.
ja: ハッシュ値は、同じプログラムの異なる発動を越えて永続的であると保証されません。

source: The hash value.
ja: ハッシュ値。

source: The hashed value of the truncation mode.
ja: 切り詰めモードのハッシュ値。

source: The hasher to use when combining the components of this instance.
ja: このインスタンスの構成要素を結合する時に使うハーシャー。

source: The higher views in a view hierarchy can override the value you set on this view.
ja: ビュー階層の中でより高いビューは、あなたがこのビュー上で設定した値をオーバーライドできます。

source: The home screen for Landmarks shows a scrolling list of categories, with horizontally scrolling landmarks within each category.
ja: Landmarksに対するホーム画面は、いくつかのカテゴリからなるあるスクロールリストを示します、各カテゴリ内で水平にスクロールするランドマークを備えます。

source: The horizontal amount, in points, by which you offset the shape.
ja: 水平量、ポイントで、それだけあなたは形状を位置埋め合わせします。

source: The horizontal distance to offset this view.
ja: このビューを補うための水平間隔。

source: The horizontal or vertical dimension in a 2D coordinate system.
ja: ある2D座標システムにおける水平または垂直次元。

source: The horizontal size class of this environment.
ja: この環境の水平サイズ等級。

source: The hosting view also coordinates event delivery.
ja: ホスティングビューはまた、イベント配達をうまく調整します。

source: The hue rotation angle to apply to the colors in this view.
ja: このビューの中の色に適用する色相回転角度。

source: The ideal height for the resulting frame.
ja: 結果フレームに対する最適な高さ。

source: The ideal height of the resulting frame.
ja: 結果フレームの理想的な高さ。

source: The ideal width for the resulting frame.
ja: 結果フレームに対する最適な幅。

source: The ideal width of the resulting frame.
ja: 結果フレームの理想的な幅。

source: The identifiable data for computing the list.
ja: リストを計算するための身元識別可能データ。

source: The identified data that the ForEach instance uses to create views dynamically.
ja: 識別されたデータ、それはForEachインスタンスが使用してビューを動的に作成するものです。

source: The identifier, often derived from the identifier of the data being displayed by the view.
ja: 識別子、たいていはビューによって表示されているデータの識別子から引き出されます。

source: The image scale for this environment.
ja: この環境に対するイメージ縮尺。

source: The image to be drawn.
ja: 描画されることになる画像。

source: The implementation of those properties and methods are responsible for updating the appropriate SwiftUI values.
ja: それらプロパティおよびメソッドの実装は、適切なSwiftUI値を更新することに対して責任をもちます。

source: The implementation should modify this value.
ja: 実装は、この値を修正すべきです。

source: The implicit range is (-infinity, +infinity).
ja: 暗黙的な範囲は、(-infinity, +infinity)です。

source: The index at which to start the resulting subsequence.
ja: それで結果の下位シーケンスが始まるインデックス。

source: The index of the first element for which predicate returns true.
ja: それに対してpredicateがtrueを返す最初の要素のインデックス。

source: The index of the last element in the collection that matches predicate, or nil if no elements match.
ja: コレクションの中の、predicateに合致する最後の要素のインデックス、またはnil、もしどんな要素も合致しないならば。

source: The index of the last element to include in the resulting subsequence.
ja: 結果の下位シーケンスの中に含まれることになる最後の要素のインデックス。

source: The index value immediately after i.
ja: iの直後のインデックス値。

source: The index value immediately before i.
ja: iの直前のインデックス値。

source: The indices that are valid for subscripting the collection, in ascending order.
ja: コレクションの添え字に使うのに有効である、昇順でのインデックス。

source: The initializers of the XMLDocument class read an external source of XML, whether it be a local file or remote website, parse it, and process it into the tree representation.
ja: XMLDocumentクラスのイニシャライザは、XMLの外部ソースを読み込みます、それがローカルファイルまたはリモートウェブサイトであろうとなかろうと、そしてそれをツリー表現へと加工処理します。

source: The inset distances for the sides of a rectangle.
ja: 矩形の辺に対する縁差込間隔。

source: The instance only reads the initial value of the provided data and doesn’t need to identify views across updates.
ja: インスタンスは、提供されたdataの初期値を読み出すだけで、ビューそれらを更新を越えて確認する必要はありません。

source: The instance that describes a platform’s default behavior and appearance for a list.
ja: あるプラットホームのもつリストに対する省略時の挙動と外観を記述するインスタンス。

source: The instance that describes the behavior and appearance of a grouped list.
ja: あるグループにされたリストの挙動と外観を記述するインスタンス。

source: The instance that describes the behavior and appearance of a plain list.
ja: あるプレーンリストの挙動と外観を記述するインスタンス。

source: The instance that describes the behavior and appearance of a sidebar list.
ja: スライドバーリストの挙動と外観を記述するインスタンス。

source: The instance that describes the behavior and appearance of carousel.
ja: カルーセルの挙動と外観を記述するインスタンス。

source: The intensity of color constrast to apply.
ja: 適用することになる色コントラストの強度。

source: The intensity of color contrast to apply.
ja: 適用することになる色コントラストの強さ。

source: The intensity of grayscale to apply.
ja: 適用するグレースケールの強度。

source: The interface an XML parser uses to inform its delegate about the content of the parsed document.
ja: 構文解析された文書の内容を委任先に知らせるためにXMLパーサが使うインターフェイス。

source: The interface displays the first interface controller listed in the namesAndContexts array initially.
ja: インターフェイスは、初めに、namesAndContexts配列においてリストされる最初のインターフェイスコントローラを表示します。

source: The intersection of [member] and the set, if the intersection was nonempty; otherwise, nil.
ja: [member]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The intersection of [newMember] and the set if the intersection was nonempty; otherwise, nil.
ja: [newMember]とこの集合の交叉、その交叉が空でなかったならば；そうでなければ、nil。

source: The joined sequence of elements.
ja: つなぎ合わされたシーケンス要素。

source: The key for a string in the table identified by tableName.
ja: tableNameによって識別されるテーブルの中のある文字列に対するキー。

source: The key for the button’s localized title, that describes the purpose of the button’s action.
ja: ボタンのもつローカライズされたタイトルに対するキー、それはボタンのもつactionの目的を記述します。

source: The key path to the data model’s identifier.
ja: データモデルのもつ識別子へのキーパス。

source: The key path to the provided data’s identifier.
ja: 提供されたデータのもつ識別子へのキーパス。

source: The key to monitor for value changes.
ja: 値の変化を監視するキー。

source: The key to read and write the value to in the user defaults store.
ja: user defaults storeにおいてその値を読み出すそして書き出すためのキー。

source: The key used to look up a string in a strings file or strings dictionary file.
ja: ある文字列を文字列ファイルまたは文字列辞書ファイルにおいて捜すために使われるキー。

source: The keys that can appear in the change dictionary.
ja: 変更辞書において現れることができるキー。

source: The keys used to access components of a locale.
ja: あるロケールの構成要素にアクセスするために使われるキー。

source: The kind of an Accessibility action.
ja: アクセシビリティアクションの種類。

source: The kinds of changes that can be observed.
ja: 監視されることが可能である変化の種類。

source: The label associated with the image.
ja: 画像と結びつけられたラベル。

source: The label is a view that describes the button’s action, for example, by showing text such as Cancel or an icon such as a back arrow.
ja: ラベルは、ボタンのもつアクションを記述するあるビューです、例えば、「キャンセル」のようなテキストや戻る矢印のようなアイコンを示すことによって。

source: The label is used for things like accessibility.
ja: ラベルは、アクセシビリティのような事柄に対して使われます。

source: The last character in the first case, which uses negative kerning, experiences cropping because the kerning affects the trailing edge of the text view as well.
ja: 最初の場合、負のカーニングを使うものでの最後の文字は、切り取りを経験します、なぜならカーニングはテキストビューの後端にもまた影響するからです。

source: The last element of the collection.
ja: コレクションの最後の要素。

source: The last element of the sequence that satisfies predicate, or nil if there is no element that satisfies predicate.
ja: predicate満たすシーケンスの最後の要素、またはpredicateを満たす要素が無いならばnil。

source: The last index where element is found.
ja: elementが見つけられたところの最後のインデックス。

source: The last view, with a positive offset, grows upward.
ja: 最後のビューは、生の相殺をもち、上に増大します。

source: The layout direction associated with the current environment.
ja: 現在の環境と結びつけられたレイアウト方向。

source: The line limit applies to all Text instances within this view.
ja: 行限度は、このビュー内の全てのTextインスタンスに適用されます。

source: The line limit.
ja: 行限度。

source: The line number of the XML document being processed by the parser.
ja: パーサーによって処理されているXML書類の行数。

source: The linear sRGB working color space, with color component values outside the range [0, 1] preserved.
ja: 線形sRGB作業色空間、範囲 [0, 1] の外側の色構成要素値それらを持ちます、保全されます。

source: The linear sRGB working color space, with color component values outside the range [0, 1] producing undefined results.
ja: 線形sRGB作業色空間、範囲 [0, 1] の外側の色構成要素値それらを持ちます、未定義結果を生じます。

source: The locale country code.
ja: ロケール国コード。

source: The locale identifier.
ja: ロケール識別子。

source: The locale language code.
ja: ロケール言語コード。

source: The locale script code.
ja: ロケール書体コード。

source: The locale to use when scanning.
ja: 走査している時に使うことになるロケール。

source: The locale variant code.
ja: ロケールバリアントコード。

source: The location of the current event.
ja: 現在のイベントの位置。

source: The location of the drag gesture’s current event.
ja: ドラッグジェスチャのもつ現在のイベントの位置。

source: The location of the drag gesture’s first event.
ja: ドラッグジェスチャのもつ最初のイベントの位置。

source: The location of the drag in the coordinate space of the drop view.
ja: ドロップビューの座標空間の中のドラッグの場所。

source: The location of the first event.
ja: 最初のイベントの場所。

source: The location with a default of center that defines a point in 3D space about which the rotation is anchored.
ja: centerの初期状態をもつ位置、それはそれについて回転が据えつけられる3D空間でのある点を定義します。

source: The location with a default of 0 that defines a point in 3D space about which the rotation is anchored.
ja: 0の初期状態をもつ位置、それはそれについて回転が据えつけられる3D空間でのある点を定義します。

source: The lower bound for the range.
ja: 範囲の下側の境界。

source: The maximum distance that the fingers or cursor performing the long press can move before the gesture fails.
ja: 長押しを実行している指またはカーソルがジェスチャを失敗する前に動くことができる最大の間隔。

source: The maximum distance that the long press can move before the gesture fails.
ja: ジェスチャが失敗する前に長押しが動くことができる最大の間隔。

source: The maximum height for the resulting frame.
ja: 結果フレームに対する最大限の高さ。

source: The maximum height of the resulting frame.
ja: 結果フレームの最大限の高さ。

source: The maximum number of elements to return.
ja: 返される要素の最大限の数。

source: The maximum number of lines is 1 if the value is less than 1.
ja: 最大の行数は、1です、もし値が1より少ないならば。

source: The maximum number of lines that text can occupy in a view.
ja: テキストがビューにおいて占有できる最大限の行数。

source: The maximum number of times to split the collection, or one less than the number of subsequences to return.
ja: コレクションを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum number of times to split the sequence, or one less than the number of subsequences to return.
ja: シーケンスを分割する回数の最大限度、または返される下位シーケンスの数より１つ少ないもの。

source: The maximum width for the resulting frame.
ja: 結果フレームに対する最大限の幅。

source: The maximum width of the resulting frame.
ja: 結果フレームの最大限の幅。

source: The measurement system associated with the locale.
ja: そのロケールと関連した寸法体系。

source: The method of triggering the button varies by platform:
ja: ボタンを作動する方式はプラットホームによって異なります：

source: The method of “triggering” the button may vary.
ja: ボタンを “作動させる” 方法は、異なるかもしれません。

source: The minimum delta required before the gesture starts.
ja: ジェスチャが開始するまでに必要とされる最小デルタ。

source: The minimum delta required before the gesture succeeds.
ja: ジェスチャが成功するまでに必要とされる最小デルタ。

source: The minimum dragging distance before the gesture succeeds.
ja: ジェスチャが成功するまでの最小限のドラッグ間隔。

source: The minimum dragging distance for the gesture to succeed.
ja: ジェスチャが成功するための最小限のドラッグ間隔。

source: The minimum duration of the long press that must elapse before the gesture succeeds.
ja: ジェスチャが成功する前に経過しなければならない長押しの最小期間。

source: The minimum height for the resulting frame.
ja: 結果フレームに対する最小限の高さ。

source: The minimum height of a header in a list.
ja: あるリストの中のヘッダの最小限の高さ。

source: The minimum height of the resulting frame.
ja: 結果フレームの最小限の高さ。

source: The minimum length this spacer can be shrunk to, along the axis or axes of expansion.
ja: このスペーサーがそれへと縮む事が可能な最小限の長さ、拡大の軸または複数の軸に沿って。

source: The minimum permissible proportion to shrink the font size to fit the text into the available space.
ja: テキストをその利用可能な空間へとぴったり合わせるためにフォントサイズを縮小するのに最小限許される割合。

source: The minimum required delta before the gesture starts.
ja: ジェスチャが始まる前に最小限必要とされるデルタ。

source: The minimum scale delta required before the gesture starts.
ja: ジェスチャが開始するまでに必要とされる最小縮尺デルタ。

source: The minimum width for the resulting frame.
ja: 結果フレームに対する最小限の幅。

source: The minimum width of the resulting frame.
ja: 結果フレームの最小限の幅。

source: The mode indicating whether the user can edit the contents of a view associated with this environment.
ja: この環境と結びつけられたあるビューの内容をユーザが編集可能かどうかを指し示しているモード。

source: The mode of a view indicating whether the user can edit its content.
ja: ユーザがそれの内容を編集可能かどうかを指し示しているあるビューのモード。

source: The multiplication factor used to resize this shape along its x-axis.
ja: この形状をそれのx軸に沿って大きさ変更するために使われる増倍率。

source: The multiplication factor used to resize this shape along its y-axis.
ja: この形状をそれのy軸に沿って大きさ変更するために使われる増倍率。

source: The multiplication factor used to resize this shape.
ja: この形状の大きさを変更するために使う増倍率。

source: The name of the nib file containing the AppKit view controller.
ja: AppKitビューコントローラを含んでいるnibファイルの名前。

source: The name of the nib file containing the UIKit view controller.
ja: UIKitビューコントローラを含んでいるnibファイルの名前。

source: The name of the string table to search.
ja: 検索する文字列テーブルの名前。

source: The names of the interface controller you want to display.
ja: あなたが表示したいインターフェイスコントローラの名前。

source: The namespace in which defines the id.
ja: それにおいてidを定義する名前空間。

source: The navigation bar title’s displayMode is set to .inline which places the navigation bar title in the bounds of the navigation bar.
ja: ナビゲーションバータイトルのもつdisplayModeは、.inlineに設定されます、それはナビゲーションバータイトルをナビゲーションバーの境界の中に配置します。

source: The new interface slides up from the bottom of the screen and completely covers the contents of the current interface controller.
ja: 新しいインターフェイスは、画面の下からせり上がります、そして完全に現在のインターフェイスコントローラの内容を覆います。

source: The new value is passed into the closure.
ja: 新しい値は、クロージャに渡されます。

source: The new value of the binding value.
ja: バインディング値の新しい値。

source: The new value that failed the comparison check.
ja: 新しい値、それは比較検査が失敗したものです。

source: The next example attempts to retrieve an index ten positions from numbers.startIndex, but fails, because that distance is beyond the index passed as limit.
ja: 次の例はnumbers.startIndexから10位置のインデックスをとりだすことを試みます、しかし失敗します、なぜならその間隔はlimitとして渡されるインデックスを越えるからです。

source: The nodes in the abstract, logical tree structure that represents an XML document.
ja: XML文書を表す、抽象的、論理ツリー構造の中のノード。

source: The non-linear sRGB working color space, with color component values outside the range [0, 1] producing undefined results.
ja: 非線形sRGB作業色空間、範囲 [0, 1] の外側の色構成要素値それらを持ちます、未定義結果を生じます。

source: The number of elements in the collection.
ja: コレクションの要素の数を返します。

source: The number of elements to drop from the beginning of the collection.
ja: コレクションの始まりから省く要素の数。

source: The number of elements to drop off the end of the collection.
ja: コレクションの終わりで省く要素の数。

source: The number of lines used to render text in the available space.
ja: 利用可能な空間の中にテキストを描出するために使われる行数。

source: The numeric grouping separator associated with the locale.
ja: そのロケールと関連した数グループ分離子。

source: The objects you create using this class are referred to as scanner objects (and when no confusion will result, merely as scanners).
ja: あなたがこのクラスを使って作成するオブジェクトは、スキャナーオブジェクト（そして結果としてどんな混同もない時は、ただ単にスキャナー）として言及されます。

source: The objects you want to pass to the interface controllers.
ja: あなたがインターフェイスコントローラに渡したいオブジェクト。

source: The observer method can use terminationStatus to determine why the task died.
ja: オブザーバメソッドは、terminationStatusを使ってなぜタスクが死んだのか決定できます。

source: The only change the effect makes to the view’s ancestors and descendants is to change the coordinate transform to and from them.
ja: その効果がビューのもつ祖先および子孫にする唯一の変更は、それらに対するそしてそれらからの座標変換の変更となります。

source: The operating system on which to run the preview.
ja: それの上でプレビューが動作するオペレーティングシステム。

source: The operation doesn’t require going beyond the limiting numbers.endIndex value, so it succeeds.
ja: この操作は、限度であるnumbers.endIndex値を越えることを要求しません、それでそれは成功します。

source: The order in which you apply modifiers matters.
ja: あなたが修飾子を適用する順番は重要です。

source: The original dimensions of the view are considered to be unchanged by offsetting the contents.
ja: ビューの元の次元それらは、内容を補うことによって変更されないとみなされます。

source: The originating gesture.
ja: 起源とするジェスチャ。

source: The outline of a 2D shape.
ja: 2D形状の輪郭。

source: The overlay enables users to instantly view the other app’s page on the App Store.
ja: オーバーレイは、ユーザが即座にApp Store上の他のアプリのページを眺めることを可能にします。

source: The overlay will automatically be presented over the current scene.
ja: オーバーレイは、自動的に現在のシーンを覆って提示されるでしょう。

source: The parameter to action contains the dropped items, with types specified by supportedTypes.
ja: actionへのパラメータは、supportedTypesで指定された型をもつ、ドロップされた項目いくつかを含みます。

source: The parametric location of the stop.
ja: その経由に対するパラメータ的な位置。

source: The parent view declares a property to hold the playing state, using the @State property wrapper to indicate that this property is the value’s source of truth.
ja: 親ビューは、あるプロパティを宣言して再生状態を保持します、@Stateプロパティラッパーを使ってこのプロパティがその値のもつ信頼できる情報源であることを指し示しています。

source: The platform on which to run the provider.
ja: それの上でプロバイダを走らせることになるプラットホーム。

source: The point at which to place the center of this view.
ja: それにこのビューの中心を置くことになるポイント。

source: The point to rotate the shape around.
ja: それを中心に形状を回転するポイント。
